renzenicolai/esp8266-firmware/app/user/cgi.c
#include <esp8266.h>
#include <util/ftoa.h>
#include "driver/ws2801.h"
#include "driver/ws2812.h"
#include "driver/ws2812gpio.h"
#include "driver/pwm.h"

//#define ESPFS_POS  0x1FC000
//#define ESPFS_SIZE 0x200000
//#define OTA_FLASH_SIZE_K 0x8000

/*#ifdef ESPFS_POS
CgiUploadFlashDef uploadParams={
	.type=CGIFLASH_TYPE_ESPFS,
	.fw1Pos=ESPFS_POS,
	.fw2Pos=0,
	.fwSize=ESPFS_SIZE,
};
#define INCLUDE_FLASH_FNS
#endif
#ifdef OTA_FLASH_SIZE_K
CgiUploadFlashDef uploadParams={
	.type=CGIFLASH_TYPE_FW,
	.fw1Pos=0x1000,
	.fw2Pos=((OTA_FLASH_SIZE_K*1024)/2)+0x1000,
	.fwSize=((OTA_FLASH_SIZE_K*1024)/2)-0x1000,
};
#define INCLUDE_FLASH_FNS
#endif*/

HttpdBuiltInUrl builtInUrls[] = {
  {"*", cgiRedirectApClientToHostname, "wifiswitch"},
  {"/", cgiRedirect, "/home"},
  {"/*", authBasicRn, NULL},
  {"/home", cgiEspFsTemplate, tplHomepage},

  {"/settings", cgiEspFsTemplate, tplSettings},
  {"/settings/store", cgiSettingsStore, NULL},

  {"/wifi", cgiEspFsTemplate, tplWifiSettings},
  {"/wifi/store", cgiWifiSettingsStore, NULL},
  {"/wifi/scan", cgiWiFiScan, NULL},
  {"/wifi/status", cgiWiFiStatus, NULL},

  {"/output", cgiSetOutput, NULL},
  {"/output/state", cgiGetOutput, NULL},
  {"/input", cgiGetInput, NULL},

  {"/sensor", cgiSensor, NULL},

  {"/WS2812set", cgiSetWS2812, NULL},

  #ifdef ENABLE_PKAWB
  {"/wb", cgiWb, NULL},
  #endif
  #ifdef PWM
  {"/pwmset", cgiSetPwm, NULL},
  #endif

  /*
  {"/flash/download", cgiReadFlash, NULL},
  {"/flash/next", cgiGetFirmwareNext, &uploadParams},
  {"/flash/upload", cgiUploadFirmware, &uploadParams},
  {"/flash/reboot", cgiRebootFirmware, NULL},*/
  //{"/flashraw.cgi", cgiUploadRaw, NULL},
  //{"/flashapp.cgi", cgiUpgradeRaw, NULL},
  //{"/getappver.cgi", cgiGetAppVer, NULL},
  //{"/websocket/ws.cgi", cgiWebsocket, myWebsocketConnect},
  {"/firmware/upload", cgiUploadTest, NULL},
  {"*", cgiEspFsHook, NULL}, //Catch-all cgi function for the filesystem
  {NULL, NULL, NULL}
};

HttpdBuiltInUrl* ICACHE_FLASH_ATTR cgi_get_builtInUrls( void )
{
  return builtInUrls;
}

//WiFi access point data
typedef struct {
  char ssid[32];
  char rssi;
  char enc;
} ApData;

//Scan result
typedef struct {
  char scanInProgress; //if 1, don't access the underlying stuff from the webpage.
  ApData **apData;
  int noAps;
} ScanResultData;

//Static scan status storage.
static ScanResultData cgiWifiAps;

#define CONNTRY_IDLE 0
#define CONNTRY_WORKING 1
#define CONNTRY_SUCCESS 2
#define CONNTRY_FAIL 3

//Callback the code calls when a wlan ap scan is done. Basically stores the result in
//the cgiWifiAps struct.
void ICACHE_FLASH_ATTR wifiScanDoneCb(void *arg, STATUS status)
{
  int n;
  struct bss_info *bss_link = (struct bss_info *)arg;
  //os_printf("wifiScanDoneCb %d\n", status);
  if (status!=OK) {
    cgiWifiAps.scanInProgress=0;
    return;
  }
  //Clear prev ap data if needed.
  if (cgiWifiAps.apData!=NULL) {
  for (n=0; n<cgiWifiAps.noAps; n++) os_free(cgiWifiAps.apData[n]);
    os_free(cgiWifiAps.apData);
  }

  //Count amount of access points found.
  n=0;
  while (bss_link != NULL) {
    bss_link = bss_link->next.stqe_next;
    n++;
  }

  //Allocate memory for access point data
  cgiWifiAps.apData=(ApData **)os_malloc(sizeof(ApData *)*n);
  cgiWifiAps.noAps=n;
  //os_printf("Scan done: found %d APs\n", n);
  //Copy access point data to the static struct
  n=0;
  bss_link = (struct bss_info *)arg;
  while (bss_link != NULL) {
    if (n>=cgiWifiAps.noAps) {
      //This means the bss_link changed under our nose. Shouldn't happen!
      //Break because otherwise we will write in unallocated memory.
      //os_printf("Huh? I have more than the allocated %d aps!\n", cgiWifiAps.noAps);
      break;
    }
    //Save the ap data.
    cgiWifiAps.apData[n]=(ApData *)os_malloc(sizeof(ApData));
    cgiWifiAps.apData[n]->rssi=bss_link->rssi;
    cgiWifiAps.apData[n]->enc=bss_link->authmode;
    strncpy(cgiWifiAps.apData[n]->ssid, (char*)bss_link->ssid, 32);

    bss_link = bss_link->next.stqe_next;
    n++;
  }
  //We're done.
  cgiWifiAps.scanInProgress=0;
}

//Routine to start a WiFi access point scan.
static void ICACHE_FLASH_ATTR wifiStartScan()
{
  if (cgiWifiAps.scanInProgress) return;
  cgiWifiAps.scanInProgress=1;
  wifi_station_scan(NULL, wifiScanDoneCb);
}

//------------------------------------------

int ICACHE_FLASH_ATTR cgiWiFiScan(HttpdConnData *connData)
{
  int pos=(int)connData->cgiData;
  int len;
  char buff[1024];

  if (!cgiWifiAps.scanInProgress && pos!=0) {
    //Fill in json code for an access point
    if (pos-1<cgiWifiAps.noAps) {
      len=os_sprintf(buff, "{\"essid\": \"%s\", \"rssi\": \"%d\", \"enc\": \"%d\"}%s\n",
          cgiWifiAps.apData[pos-1]->ssid, cgiWifiAps.apData[pos-1]->rssi,
          cgiWifiAps.apData[pos-1]->enc, (pos-1==cgiWifiAps.noAps-1)?"":",");
      httpdSend(connData, buff, len);
    }
    pos++;
    if ((pos-1)>=cgiWifiAps.noAps) {
      len=os_sprintf(buff, "]\n}\n}\n");
      httpdSend(connData, buff, len);
      //Also start a new scan.
      wifiStartScan();
      return HTTPD_CGI_DONE;
    } else {
      connData->cgiData=(void*)pos;
      return HTTPD_CGI_MORE;
    }
  }

  httpdStartResponse(connData, 200);
  httpdHeader(connData, "Content-Type", "text/json");
  httpdEndHeaders(connData);

  if (cgiWifiAps.scanInProgress==1) {
    //We're still scanning. Tell Javascript code that.
    len=os_sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"1\"\n }\n}\n");
    httpdSend(connData, buff, len);
    return HTTPD_CGI_DONE;
  } else {
    //We have a scan result. Pass it on.
    len=os_sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"0\", \n\"APs\": [\n");
    httpdSend(connData, buff, len);
    if (cgiWifiAps.apData==NULL) cgiWifiAps.noAps=0;
    connData->cgiData=(void *)1;
    return HTTPD_CGI_MORE;
  }
}

char temperatureString[10] = "Unknown";
char pressureString[10] = "Unknown";

void ICACHE_FLASH_ATTR updateSensorStrings ( void )
{
  float temperature = board_sensorGetTemperature()/10.0;
  os_memcpy(temperatureString, ftoa(temperature, 1), 10);

