renzenicolai/esp8266-firmware/app/user/cgi.c
  float pressure = board_sensorGetAirPressure()/1000.0;
  os_memcpy(pressureString, ftoa(pressure, 3), 10);

  //os_printf("Sensordata: %s*c, %s kPa.\r\n", temperatureString, pressureString);
}

void ICACHE_FLASH_ATTR setLabelString(char* buff, uint8_t item)
{
  #ifdef ENABLE_PKAWB
    userSettings_t* settings = settings_get_pointer();
    if (settings->pka_wb==0) {
      os_sprintf(buff, "Output %d", item);
      return;
    } else if (item==1) {
      os_sprintf(buff, "Window blinds");
      return;
    } else if (item==3) {
      os_sprintf(buff, "Output");
      return;
    }
    os_sprintf(buff, "&nbsp;");
    return;
  #else
    os_sprintf(buff, "Output %d", item);
    return;
  #endif
}

void ICACHE_FLASH_ATTR setInputString(char* buff, uint8_t item)
{
  bool result = false;
  #ifdef INPUT1
    if ((item==1) && (board_getInput(INPUT1))) result = true;
  #endif
  #ifdef INPUT2
    if ((item==2) && (board_getInput(INPUT2))) result = true;
  #endif
  #ifdef INPUT3
    if ((item==3) && (board_getInput(INPUT3))) result = true;
  #endif
  #ifdef INPUT4
    if ((item==4) && (board_getInput(INPUT4))) result = true;
  #endif
  #ifdef INPUT5
    if ((item==5) && (board_getInput(INPUT5))) result = true;
  #endif
  #ifdef INPUT6
    if ((item==6) && (board_getInput(INPUT6))) result = true;
  #endif
  #ifdef INPUT7
    if ((item==7) && (board_getInput(INPUT7))) result = true;
  #endif
  #ifdef INPUT8
    if ((item==8) && (board_getInput(INPUT8))) result = true;
  #endif

  if (result) {
    os_sprintf(buff, "<img src='lightbulb_on.png' />");
  } else {
    os_sprintf(buff, "<img src='lightbulb_off.png' />");
  }
}

void ICACHE_FLASH_ATTR setSwitchString(char* buff, uint8_t item)
{
  bool normalbutton = false;
  uint32_t pin = 0;
  userSettings_t* settings = settings_get_pointer();
  #ifdef ENABLE_PKAWB
  if (settings->pka_wb==0) {
  #endif
    if (item==1) pin = OUTPUT1;
    if (item==2) pin = OUTPUT2;
    if (item==3) pin = OUTPUT3;
    normalbutton = true;
  #ifdef ENABLE_PKAWB
  } else {
    if (item==1) {
      if (board_wbMode()==2) {
        if (board_wbState()) {
          os_sprintf(buff, "<a class='button' href='/wb?mode=0'>DOWN</a>");
        } else {
          os_sprintf(buff, "<a class='button' href='/wb?mode=1'>UP</a>");
        }
      } else {
        os_sprintf(buff, "<a class='button' href='/wb?mode=2'>STOP</a>");
      }
      return;
    }
    if (item==2) {
      if (board_wbMode()==2) {
        if (board_wbState()) {
          os_sprintf(buff, "State: up");
        } else {
          os_sprintf(buff, "State: down");
        }
      } else {
        if (board_wbState()) {
          os_sprintf(buff, "State: moving up");
        } else {
          os_sprintf(buff, "State: moving down");
        }
      }
      return;
    }
    if (item==3) {
      switch(settings->pka_wb) {
        case 4:
        case 6:
         pin = OUTPUT1;
         normalbutton = true;
         break;
        case 2:
        case 5:
         pin = OUTPUT2;
         normalbutton = true;
         break;
        case 1:
        case 3:
         pin = OUTPUT3;
         normalbutton = true;
         break;
      }
    }
  }
  #endif

  if (normalbutton) {
    char text2[4] = "on";
    char text[4] = "OFF";
    if (board_getOutput(pin)) {
      os_sprintf(text, "ON");
      os_sprintf(text2, "off");
    }
    os_sprintf(buff, "<a class='button' href='/output?pin=%d&state=%d'>[%s] Switch %s</a>", pin, !board_getOutput(pin), text, text2);
    return;
  }
  os_sprintf(buff, "&nbsp;");
  return;
}

//Template code for the homepage
int ICACHE_FLASH_ATTR tplHomepage(HttpdConnData *connData, char *token, void **arg) {
  char buff[512];
  if (token==NULL) return HTTPD_CGI_DONE;

  if (os_strcmp(token, "temperature")==0) {
    updateSensorStrings(); //Called 1st
    os_sprintf(buff, "%s", temperatureString);
  }
  if (os_strcmp(token, "pressure")==0) {
    //updateSensorStrings(); //Called 2nd, update not needed
    os_sprintf(buff, "%s", pressureString);
  }
  /*if (os_strcmp(token, "hour")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  }
  if (os_strcmp(token, "minute")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  }
  if (os_strcmp(token, "second")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  } */
  uint8_t c;
  char t[32];
  for (c=0;c<8;c++) {
    os_sprintf(t, "label%d", c);
    if (os_strcmp(token, t)==0) {
      setLabelString(buff, c);
    }
    os_sprintf(t, "output%d", c);
    if (os_strcmp(token, t)==0) {
      setSwitchString(buff, c);
    }
    os_sprintf(t, "input%d", c);
    if (os_strcmp(token, t)==0) {
      setInputString(buff, c);
    }
  }
  if (os_strcmp(token, "hidewarning")==0) {
    wifiSettings_t* settings = wifiSettingsGetPointer();
    if (!settings->setupEnabled) {
      os_sprintf(buff, " hidden");
    } else {
      os_sprintf(buff, "");
    }
  }

  if (os_strcmp(token, "hostname")==0) {
    os_memcpy( buff, settings_get_pointer()->name, 32 );
  }
    
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiGetInput(HttpdConnData *connData) {
  int len;
  char buff[256];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }
  
  os_sprintf(buff, "ERROR" );
  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) os_sprintf(buff, "%d", board_getInput(atoi(buff)));
  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiGetOutput(HttpdConnData *connData) {
  int len;
  char buff[256];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }
  
  os_sprintf(buff, "ERROR" );
  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) os_sprintf(buff, "%d", board_getOutput(atoi(buff)));

  len=httpdFindArg(connData->post->buff, "switchstring", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "switchstring", buff, sizeof(buff));
  if (len>0) setSwitchString(buff, atoi(buff));

  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiGetJsonInfo(HttpdConnData *connData) {
  int len;
  char buff[256];

