renzenicolai/esp8266-firmware/app/user/cgi.c
  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }
  
  os_sprintf(buff, "{'vendor':'RNPLUS','class':'IO_RELAY','device':'Device name','version':'5','digital_input':[['Sensor 1',0,0,0],['Sensor 2',0,0,0],['Sensor 3',0,0,0],['Sensor 4',0,0,0]],'digital_output':[['Output 1',0,0,0],['Output 2',0,0,0],['Output 3',0,0,0]]}" );

  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiSetOutput(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  uint32_t pin = 999;
  bool state = false;

  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) pin=atoi(buff);
  len=httpdFindArg(connData->post->buff, "state", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "state", buff, sizeof(buff));
  if (len>0) state=atoi(buff);

  bool result = board_setOutput(pin, state);

  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "home");
    return HTTPD_CGI_DONE;
  }
}

#ifdef PWM
int ICACHE_FLASH_ATTR cgiSetPwm(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  bool result = false;
  int red = 0;
  int green = 0;
  int blue = 0;

  len=httpdFindArg(connData->post->buff, "color", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "color", buff, sizeof(buff));
  if (len==6) {
    //pin=atoi(buff);
    char rstring[3] = {0};
    char gstring[3] = {0};
    char bstring[3] = {0};
    os_memcpy( rstring, buff, 2 );
    os_memcpy( gstring, buff+2, 2 );
    os_memcpy( bstring, buff+4, 2 );
    red = (int)strtol(rstring, NULL, 16);
    green = (int)strtol(gstring, NULL, 16);
    blue = (int)strtol(bstring, NULL, 16);

    #ifdef PWM
      //os_printf("CGI_PWMSET_PWM\r\n");
      pwm_set_all(red, green, blue);
      result = true;
    #endif
    #ifdef WS2801
      //os_printf("CGI_PWMSET_WS2801\r\n");
      ws2801_set_all(red, green, blue);
      ws2801_send(false);
      result = true;
    #endif
    #if defined(WS2812) || defined(WS2812GPIO)
      //os_printf("CGI_PWMSET_WS2812\r\n");
      ws2812_set_all(red, green, blue);
      ws2812_send(false);
      result = true;
    #endif
  }

  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "pwm");
    return HTTPD_CGI_DONE;
  }
}
#endif

int ICACHE_FLASH_ATTR cgiSetWS2812(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  bool result = false;
  int red = 0;
  int green = 0;
  int blue = 0;

  len=httpdFindArg(connData->post->buff, "color", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "color", buff, sizeof(buff));
  if (len==6) {
    //pin=atoi(buff);
    char rstring[3] = {0};
    char gstring[3] = {0};
    char bstring[3] = {0};
    os_memcpy( rstring, buff, 2 );
    os_memcpy( gstring, buff+2, 2 );
    os_memcpy( bstring, buff+4, 2 );
    red = (int)strtol(rstring, NULL, 16);
    green = (int)strtol(gstring, NULL, 16);
    blue = (int)strtol(bstring, NULL, 16);
    uint8_t buffer[64] = {0};
    buffer[0] = green;
    buffer[1] = red;
    buffer[2] = blue;
    //board_setWS2812(buffer, 3);
    //os_printf("WS2812 SET TO %x,%x,%x\r\n", red, green, blue);
    result = true;
  }

  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "ws2812");
    return HTTPD_CGI_DONE;
  }
}


//Template code for the settings page
int ICACHE_FLASH_ATTR tplSettings(HttpdConnData *connData, char *token, void **arg)
{
  char buff[128];
  if (token==NULL) return HTTPD_CGI_DONE;

  if (os_strcmp(token, "hidewarning")==0) {
    wifiSettings_t* settings = wifiSettingsGetPointer();
    if (!settings->setupEnabled) {
      os_sprintf(buff, " hidden");
    } else {
      os_sprintf(buff, "");
    }
  }
  userSettings_t* settings = settings_get_pointer();
  if (os_strcmp(token, "name")==0) {
    os_memcpy( buff, settings->name, 64 );
  }
  if (os_strcmp(token, "hostname")==0) {
    os_memcpy( buff, settings->hostname, 32 );
  }
  if (os_strcmp(token, "enable_mdns")==0) {
    if (settings->enable_mdns) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "enable_ntp")==0) {
    if (settings->enable_ntp) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "ntp_server")==0) os_memcpy( buff, settings->ntpserver, 64 );
  if (os_strcmp(token, "timezone")==0) os_sprintf( buff, "%d", settings->timezone );
  if (os_strcmp(token, "ntp_summer")==0) {
    if (settings->enable_summertime) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "bootstate")==0) os_sprintf( buff, "%d", settings->bootstate );
  if (os_strcmp(token, "authEnable")==0) {
    if (settings->authEnable) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "authUser")==0) os_memcpy( buff, settings->authUser, 64 );
  if (os_strcmp(token, "authPassword")==0) os_memcpy( buff, settings->authPassword, 64 );
  
  #ifdef WS2801
    if (os_strcmp(token, "ws2801Enabled")==0) {
      if (settings->ws2801Enabled) {
        os_sprintf(buff, " checked");
      } else {
        os_sprintf(buff, "");
      }
    }
    if (os_strcmp(token, "ws2801Length")==0) os_sprintf( buff, "%d", settings->ws2801Length );
    if (os_strcmp(token, "ws2801BootstateR")==0) os_sprintf( buff, "%d", settings->ws2801BootstateR );
    if (os_strcmp(token, "ws2801BootstateG")==0) os_sprintf( buff, "%d", settings->ws2801BootstateG );
    if (os_strcmp(token, "ws2801BootstateB")==0) os_sprintf( buff, "%d", settings->ws2801BootstateB );
  #endif
  #if defined(WS2812) || defined(WS2812GPIO)
    if (os_strcmp(token, "ws2812Enabled")==0) {
      if (settings->ws2812Enabled) {
        os_sprintf(buff, " checked");
      } else {
        os_sprintf(buff, "");
      }
    }
    if (os_strcmp(token, "ws2812Length")==0) os_sprintf( buff, "%d", settings->ws2812Length );
    if (os_strcmp(token, "ws2812BootstateR")==0) os_sprintf( buff, "%d", settings->ws2812BootstateR );
    if (os_strcmp(token, "ws2812BootstateG")==0) os_sprintf( buff, "%d", settings->ws2812BootstateG );
    if (os_strcmp(token, "ws2812BootstateB")==0) os_sprintf( buff, "%d", settings->ws2812BootstateB );
  #endif
  #ifdef ENABLE_PKAWB
    if (os_strcmp(token, "pka_wb")==0) os_sprintf( buff, "%d", settings->pka_wb );
    if (os_strcmp(token, "pka_wb_time")==0) os_sprintf( buff, "%d", settings->pka_wb_time );
  #endif
  
  int i = 0;
  char t[12];
  for (i = 0; i<16; i++) {
    os_sprintf(t, "actSensor%d", i);
    if (os_strcmp(token, t)==0) os_sprintf( buff, "%d", settings->actSensor[i] ); 
    os_sprintf(t, "sensor%d_time", i);
    if (os_strcmp(token, t)==0) os_sprintf( buff, "%d", settings->sensorTimeout[i] );
    os_sprintf(t, "sensor%d_url", i);
    if (os_strcmp(token, t)==0) os_sprintf( buff, "%s", settings->sensorActionUrl[i] );
  }
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

//Template code for the wifi settings page
int ICACHE_FLASH_ATTR tplWifiSettings(HttpdConnData *connData, char *token, void **arg)
{
  char buff[128];
  if (token==NULL) return HTTPD_CGI_DONE;
  wifiSettings_t* settings = wifiSettingsGetPointer();
  if (settings->setupEnabled) {
    if (os_strcmp(token, "ssid")==0) {
      os_memcpy( buff, settings->ssid, 32 );
    }
    if (os_strcmp(token, "password")==0) {
      os_memcpy( buff, settings->password, 64 );
    }
    if (os_strcmp(token, "enable_dhcp")==0) {
      if (settings->enable_dhcp) {
        os_sprintf(buff, " checked");
      } else {
        os_sprintf(buff, "");
      }
    }
    if (os_strcmp(token, "static_ip_1")==0) os_sprintf(buff, "%d", settings->static_ip_1);
    if (os_strcmp(token, "static_ip_2")==0) os_sprintf(buff, "%d", settings->static_ip_2);
    if (os_strcmp(token, "static_ip_3")==0) os_sprintf(buff, "%d", settings->static_ip_3);
    if (os_strcmp(token, "static_ip_4")==0) os_sprintf(buff, "%d", settings->static_ip_4);
    if (os_strcmp(token, "static_gateway_1")==0) os_sprintf(buff, "%d", settings->static_gateway_1);
    if (os_strcmp(token, "static_gateway_2")==0) os_sprintf(buff, "%d", settings->static_gateway_2);
    if (os_strcmp(token, "static_gateway_3")==0) os_sprintf(buff, "%d", settings->static_gateway_3);
    if (os_strcmp(token, "static_gateway_4")==0) os_sprintf(buff, "%d", settings->static_gateway_4);
    if (os_strcmp(token, "static_netmask_1")==0) os_sprintf(buff, "%d", settings->static_netmask_1);
    if (os_strcmp(token, "static_netmask_2")==0) os_sprintf(buff, "%d", settings->static_netmask_2);
    if (os_strcmp(token, "static_netmask_3")==0) os_sprintf(buff, "%d", settings->static_netmask_3);
    if (os_strcmp(token, "static_netmask_4")==0) os_sprintf(buff, "%d", settings->static_netmask_4);
    if (os_strcmp(token, "static_dns_1")==0) os_sprintf(buff, "%d", settings->static_dns_1);
    if (os_strcmp(token, "static_dns_2")==0) os_sprintf(buff, "%d", settings->static_dns_2);
    if (os_strcmp(token, "static_dns_3")==0) os_sprintf(buff, "%d", settings->static_dns_3);
    if (os_strcmp(token, "static_dns_4")==0) os_sprintf(buff, "%d", settings->static_dns_4);
    if (os_strcmp(token, "static_altdns_1")==0) os_sprintf(buff, "%d", settings->static_altdns_1);
    if (os_strcmp(token, "static_altdns_2")==0) os_sprintf(buff, "%d", settings->static_altdns_2);
    if (os_strcmp(token, "static_altdns_3")==0) os_sprintf(buff, "%d", settings->static_altdns_3);
    if (os_strcmp(token, "static_altdns_4")==0) os_sprintf(buff, "%d", settings->static_altdns_4);
  } else {
    strcpy(buff, "NOT IN SETUP MODE");
  }
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiSettingsStore(HttpdConnData *connData)
{
  int len;
  char buff[1024];
  userSettings_t* settings = settings_get_pointer();
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "name", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "name", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->name, buff, 64);
  len=httpdFindArg(connData->post->buff, "hostname", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "hostname", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->hostname, buff, 32);
  len=httpdFindArg(connData->post->buff, "enable_mdns", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_mdns", buff, sizeof(buff));
  if (len>0) { settings->enable_mdns = atoi(buff); } else { settings->enable_mdns = false; }
  len=httpdFindArg(connData->post->buff, "enable_ntp", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_ntp", buff, sizeof(buff));
  if (len>0) { settings->enable_ntp = atoi(buff); } else { settings->enable_ntp = false; }
  len=httpdFindArg(connData->post->buff, "ntp_server", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ntp_server", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->ntpserver, buff, 64);
  len=httpdFindArg(connData->post->buff, "timezone", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "timezone", buff, sizeof(buff));
  if (len>0) settings->timezone = atoi(buff);
  len=httpdFindArg(connData->post->buff, "enable_summertime", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_summertime", buff, sizeof(buff));
  if (len>0) { settings->enable_summertime = atoi(buff); } else { settings->enable_summertime = false; }
  len=httpdFindArg(connData->post->buff, "authEnable", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "authEnable", buff, sizeof(buff));
  if (len>0) { settings->authEnable = atoi(buff); } else { settings->authEnable = false; }
  len=httpdFindArg(connData->post->buff, "authUser", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "authUser", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->authUser, buff, 64);
  len=httpdFindArg(connData->post->buff, "authPassword", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "authPassword", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->authPassword, buff, 64);
  len=httpdFindArg(connData->post->buff, "bootstate", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "bootstate", buff, sizeof(buff));
  if (len>0) settings->bootstate = atoi(buff);
  #ifdef WS2801
    len=httpdFindArg(connData->post->buff, "ws2801Enabled", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2801Enabled", buff, sizeof(buff));
    if (len>0) { settings->ws2801Enabled = atoi(buff); } else { settings->ws2801Enabled = false; }
    len=httpdFindArg(connData->post->buff, "ws2801Length", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2801Length", buff, sizeof(buff));
    if (len>0) settings->ws2801Length = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2801BootstateR", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2801BootstateR", buff, sizeof(buff));
    if (len>0) settings->ws2801BootstateR = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2801BootstateG", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2801BootstateG", buff, sizeof(buff));
    if (len>0) settings->ws2801BootstateG = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2801BootstateB", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2801BootstateB", buff, sizeof(buff));
    if (len>0) settings->ws2801BootstateB = atoi(buff);
  #endif
  #if defined(WS2812) || defined(WS2812GPIO)
    len=httpdFindArg(connData->post->buff, "ws2812Enabled", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2812Enabled", buff, sizeof(buff));
    if (len>0) { settings->ws2812Enabled = atoi(buff); } else { settings->ws2812Enabled = false; }
    len=httpdFindArg(connData->post->buff, "ws2812Length", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2812Length", buff, sizeof(buff));
    if (len>0) settings->ws2812Length = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2812BootstateR", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2812BootstateR", buff, sizeof(buff));
    if (len>0) settings->ws2812BootstateR = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2812BootstateG", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2812BootstateG", buff, sizeof(buff));
    if (len>0) settings->ws2812BootstateG = atoi(buff);
    len=httpdFindArg(connData->post->buff, "ws2812BootstateB", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "ws2812BootstateB", buff, sizeof(buff));
    if (len>0) settings->ws2812BootstateB = atoi(buff);
  #endif
  #ifdef ENABLE_PKAWB
    len=httpdFindArg(connData->post->buff, "pka_wb", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "pka_wb", buff, sizeof(buff));
    if (len>0) settings->pka_wb = atoi(buff);
    len=httpdFindArg(connData->post->buff, "pka_wb_time", buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, "pka_wb_time", buff, sizeof(buff));
    if (len>0) settings->pka_wb_time = atoi(buff); 
  #endif
  //Sensoractions
  int i = 0;
  char t[12];
  for (i = 0; i<16; i++) {
    os_sprintf(t, "actSensor%d", i);
    len=httpdFindArg(connData->post->buff, t, buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, t, buff, sizeof(buff));
    if (len>0) settings->actSensor[i] = atoi(buff);
    os_sprintf(t, "sensor%d_time", i);
    len=httpdFindArg(connData->post->buff, t, buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, t, buff, sizeof(buff));
    if (len>0) settings->sensorTimeout[i] = atoi(buff);
    os_sprintf(t, "sensor%d_url", i);
    len=httpdFindArg(connData->post->buff, t, buff, sizeof(buff));
    if (len<=0) len=httpdFindArg(connData->getArgs, t, buff, sizeof(buff));
    if (len>0) os_memcpy(settings->sensorActionUrl[i], buff, 256);
  }
  settings_store( settings );
  httpdRedirect(connData, "/settingsstored");
  //settings_apply( settings, false );
  //Apply settings:
  wifi_station_set_hostname(settings->hostname); //Try to set hostname (TO-DO: create function that handles this correctly)
  mdnsStart(); //(re-)init or disable MDNS according to settings
  init_drivers(); //(re-)init or disable drivers according to settings
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiWifiSettingsStore(HttpdConnData *connData)
{
  int len;
  char buff[1024];
  wifiSettings_t* settings = wifiSettingsGetPointer();
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "ssid", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ssid", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->ssid, buff, 32);
  len=httpdFindArg(connData->post->buff, "password", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "password", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->password, buff, 64);
  len=httpdFindArg(connData->post->buff, "enable_dhcp", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_dhcp", buff, sizeof(buff));
  if (len>0) { settings->enable_dhcp = atoi(buff); } else { settings->enable_dhcp = false; }
  len=httpdFindArg(connData->post->buff, "static_ip_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_1", buff, sizeof(buff));
  if (len>0) settings->static_ip_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_2", buff, sizeof(buff));
  if (len>0) settings->static_ip_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_3", buff, sizeof(buff));
  if (len>0) settings->static_ip_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_4", buff, sizeof(buff));
  if (len>0) settings->static_ip_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_1", buff, sizeof(buff));
  if (len>0) settings->static_gateway_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_2", buff, sizeof(buff));
  if (len>0) settings->static_gateway_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_3", buff, sizeof(buff));
  if (len>0) settings->static_gateway_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_4", buff, sizeof(buff));
  if (len>0) settings->static_gateway_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_1", buff, sizeof(buff));
  if (len>0) settings->static_netmask_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_2", buff, sizeof(buff));
  if (len>0) settings->static_netmask_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_3", buff, sizeof(buff));
  if (len>0) settings->static_netmask_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_4", buff, sizeof(buff));
  if (len>0) settings->static_netmask_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_dns_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_dns_1", buff, sizeof(buff));
  if (len>0) settings->static_dns_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_dns_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_dns_2", buff, sizeof(buff));
  if (len>0) settings->static_dns_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_dns_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_dns_3", buff, sizeof(buff));
  if (len>0) settings->static_dns_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_dns_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_dns_4", buff, sizeof(buff));
  if (len>0) settings->static_dns_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_altdns_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_altdns_1", buff, sizeof(buff));
  if (len>0) settings->static_altdns_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_altdns_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_altdns_2", buff, sizeof(buff));
  if (len>0) settings->static_altdns_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_altdns_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_altdns_3", buff, sizeof(buff));
  if (len>0) settings->static_altdns_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_altdns_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_altdns_4", buff, sizeof(buff));
  if (len>0) settings->static_altdns_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "force", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "force", buff, sizeof(buff));
  if (len>0) {
    char buff[256];
    os_sprintf(buff, "Settings forcefully applied.<br />To re-enable setup mode please press the setup button on the device.<br />Please reset the device now.");
    httpdSend(connData, buff, strlen(buff));
    settings->setupEnabled = false;
    wifiSettingsWriteToFlash( settings );
    //os_printf("APPLIED WIFI SETTINGS WITHOUT CHECK.\r\n");
  } else {
    wifiSetupCommit( settings );
    httpdRedirect(connData, "/wificonntest");
    //os_printf("WifiSetupCommit called.\r\n");
  }
  return HTTPD_CGI_DONE;
}

