renzenicolai/esp8266-firmware/app/user/cgi.c
int ICACHE_FLASH_ATTR cgiWiFiStatus(HttpdConnData *connData)
{
  int len;
  char buff[256];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;

  len=httpdFindArg(connData->post->buff, "ip", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ip", buff, sizeof(buff));
  if (len>0) {
    struct ip_info info;
    wifi_get_ip_info( 0x00, &info );
    os_sprintf(buff, IPSTR, IP2STR(&info.ip));
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

  len=httpdFindArg(connData->post->buff, "ssid", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ssid", buff, sizeof(buff));
  if (len>0) {
    os_sprintf(buff, "%s", wifiSettingsGetPointer()->ssid);
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

  len=httpdFindArg(connData->post->buff, "ct", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ct", buff, sizeof(buff));
  if (len>0) {
    uint8_t ctr = 0; //Not doing anything
    if (wifiGetConnectionTest()) {
      ctr = 1; //testing...
    }
    if (wifiGetConnectionTestEnded()) {
      if (wifiGetConnectionResult()) {
        if (wifiGetConnectionHasIp()) {
          ctr = 4; //success
        } else {
          ctr = 3; //waiting for ip
        }
      } else {
        ctr = 2; //failed
      }
    }
    os_sprintf(buff, "%d", ctr);
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

  os_sprintf(buff, "%d", wifi_station_get_connect_status());
  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

#ifdef ENABLE_PKAWB
int ICACHE_FLASH_ATTR cgiWb(HttpdConnData *connData)
{
  int len;
  bool result = false;
  char buff[1024];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "mode", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "mode", buff, sizeof(buff));
  if (len>0) {
    uint8_t mode = atoi(buff);
    if (mode==0) {
      board_wbDown();
      result = true;
    }
    if (mode==1) {
      board_wbUp();
      result = true;
    }
    if (mode==2) {
      board_wbStop();
      result = true;
    }
  }
  
  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
  } else {
    httpdRedirect(connData, "home");
  }
  return HTTPD_CGI_DONE;
}
#endif

int ICACHE_FLASH_ATTR cgiSensor(HttpdConnData *connData)
{
  int len;
  bool result = false;
  char buff[1024];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;

  len=httpdFindArg(connData->post->buff, "temperature", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "temperature", buff, sizeof(buff));
  if (len>0) {
    //updateSensorStrings();
    //os_sprintf(buff, "%s", temperatureString);
    os_sprintf(buff, "%d", board_sensorGetTemperature()); //Return temperature as int32_t value instead of float (20.0*c -> 200)
    httpdSend(connData, buff, strlen(buff));
  }
  
  len=httpdFindArg(connData->post->buff, "pressure", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pressure", buff, sizeof(buff));
  if (len>0) {
    //updateSensorStrings();
    //os_sprintf(buff, "%s", pressureString);
    os_sprintf(buff, "%d", board_sensorGetAirPressure()); //Return pressure as int32_t value (in Pa)
    httpdSend(connData, buff, strlen(buff));
  }
  
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiUploadTest(HttpdConnData *connData)
{
  char buff[1024];
  os_sprintf(buff, "Not implemented.");
  httpdSend(connData, buff, strlen(buff));  
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiOta(HttpdConnData *connData)
{
  char buff[1024];
  os_sprintf(buff, "Not implemented.");
  httpdSend(connData, buff, strlen(buff));  
  return HTTPD_CGI_DONE;
}
